package com.task1;

public class Main {
/*Написать программу для поиска минимального из двух чисел.*

 */

    public static void main(String[] args) {
    System.out.println("Задача 1. Поиск минимального значения" );

	int a = 2;
	int b = 7;

		System.out.println("ввели "+a );
		System.out.println("ввели "+b );
	if (a<b)
	System.out.println("Ответ: "+a);
	else System.out.println("Ответ: "+b);

    }
}
